# DeletingBadFamTypeDumped Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..DeletingBadFamTypeDumped Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Can't make type "[Family Name]". It will be deleted. Failing family has been saved to "[File Name]"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DeletingBadFamTypeDumped { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DeletingBadFamTypeDumped As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DeletingBadFamTypeDumped {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace